In [1]:
import platform
print(platform.python_version())
# The Python version I used is "3.12.3".

3.12.3

In [2]:
from importlib.metadata import version
print(version('pandas')) # pandas 2.2.2
print(version('numpy')) # numpy 1.26.4

2.2.2
1.26.4

In [3]:
import pandas as pd
import numpy as np

# Data Preprocessing

### Load datasets

In [4]:
# Load data
data1 = pd.read_csv("Card Transactions 2014.csv")
data2 = pd.read_csv("Card Transactions 2015-2016.csv")
data3 = pd.read_csv("Card Transactions 2016-2017.csv")

### Explore first and last few rows of data

In [5]:
data1.head()

,Service Area,Account Description,Creditor,Transaction Date,JV Reference,JV Date,JV Value
0,Childrens Services,IT Services,123-REG.CO.UK,23/04/2014,93,20/05/2014,143.81
1,Childrens Services,Other Services,ACCESS EXPEDITIONS,03/04/2014,111,20/05/2014,"6,000.00"
2,Childrens Services,Equipment and Materials Repair,AFE SERVICELINE,02/04/2014,6,20/05/2014,309.38
3,Childrens Services,Equipment and Materials Repair,AFE SERVICELINE,02/04/2014,7,20/05/2014,218.76
4,Childrens Services,Building Repairs & Maintenance,ALLSOP & FRANCIS,15/04/2014,381,20/05/2014,306

In [6]:
data1.tail()

,Service Area,Account Description,Creditor,Transaction Date,JV Reference,JV Date,JV Value
4557,Adults and Communities,Postage,WWW.ROYALMAIL.COM,23/02/2015,5002,16/03/2015,124
4558,Children's Family Services,Equipment and Materials Purcha,WWW.SMYTHSTOYS.COM,20/02/2015,5188,16/03/2015,89.96
4559,Children's Family Services,Equipment and Materials Purcha,WWW.TTS-GROUPS.CO.U,06/02/2015,5207,16/03/2015,445.92
4560,Children's Family Services,Books-CDs-Audio-Video,WWW.WILDGOOSE.AC,09/02/2015,5271,16/03/2015,407.44
4561,Children's Family Services,Other Transfer Payments to Soc,www.1st4footballtic,06/02/2015,4895,16/03/2015,153

In [7]:
data2.head()

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
0,Assurance,Miscellaneous Expenses,43033820 COSTA COFFEE,18/08/2015,5043.0,2
1,Children's Family Services,Miscellaneous Expenses,99 PLUS DISCOUNT MART,08/06/2015,4184.0,29.97
2,Children's Family Services,E19 - Learning Resources,99P STORES LTD,07/12/2015,6278.0,34.65
3,Children's Family Services,Equipment and Materials Purcha,99P STORES LTD,18/08/2015,5041.0,10.72
4,Children's Family Services,Subsistence,CHOPSTIX00000000000,21/05/2015,5750.0,33.7

In [8]:
data2.tail()

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
3860,Children's Family Services,Food Costs,ZAHRA NEWSAGENT,17/11/2015,6042.0,3.5
3861,Children's Family Services,Food Costs,ZAHRA NEWSAGENT,20/01/2016,6751.0,4.5
3862,Children's Family Services,Food Costs,ZAHRA NEWSAGENT,21/03/2016,7535.0,4.5
3863,Children's Family Services,Food Costs,ZAHRA NEWSAGENT,31/03/2016,7639.0,4.5
3864,NaN,NaN,NaN,NaN,NaN,"381,012.77"

In [9]:
data3.head()

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
0,Assurance,Travelling Expenses,TICKETOFFICESALE,04/03/2016,7331.0,29.10
1,Assurance,Travelling Expenses,SELFSERVE TICKET,07/03/2016,7342.0,10.00
2,Assurance,Miscellaneous Expenses,BIRMINGHAM CC,22/04/2016,7871.0,69.00
3,Assurance,Miscellaneous Expenses,BIRMINGHAM CC,25/04/2016,7891.0,13.00
4,Assurance,Miscellaneous Expenses,D H C LTD,08/06/2016,8320.0,170.85

In [10]:
data3.tail()

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
3954,NaN,NaN,NaN,NaN,NaN,NaN
3955,NaN,NaN,NaN,NaN,NaN,NaN
3956,NaN,NaN,NaN,NaN,NaN,NaN
3957,NaN,NaN,NaN,NaN,NaN,NaN
3958,NaN,NaN,NaN,NaN,NaN,NaN

### Remove redundant rows and column, make column names consistent, and convert data types to the same formats before merging

In [11]:
data2 = data2.iloc[:-1,]
data1.dropna(how='all', inplace=True)
data2.dropna(how='all', inplace=True)
data3.dropna(how='all', inplace=True)

In [12]:
del(data1['JV Date'])
data1.rename(columns = {'Transaction Date':'Journal Date', 'JV Reference':'Journal Reference', 'JV Value':'Total'}, inplace = True)

In [13]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4562 entries, 0 to 4561
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Service Area         4562 non-null   object
 1   Account Description  4562 non-null   object
 2   Creditor             4562 non-null   object
 3   Journal Date         4562 non-null   object
 4   Journal Reference    4562 non-null   int64
 5   Total                4562 non-null   object
dtypes: int64(1), object(5)
memory usage: 214.0+ KB

In [14]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3864 entries, 0 to 3863
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Service Area         3864 non-null   object
 1   Account Description  3864 non-null   object
 2   Creditor             3864 non-null   object
 3   Journal Date         3864 non-null   object
 4   Journal Reference    3864 non-null   float64
 5   Total                3864 non-null   object
dtypes: float64(1), object(5)
memory usage: 181.3+ KB

In [15]:
data3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1604 entries, 0 to 1603
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Service Area         1604 non-null   object
 1   Account Description  1604 non-null   object
 2   Creditor             1604 non-null   object
 3   Journal Date         1604 non-null   object
 4   Journal Reference    1604 non-null   float64
 5   Total                1604 non-null   float64
dtypes: float64(2), object(4)
memory usage: 87.7+ KB

In [16]:
data1['Total'] = data1['Total'].str.replace(',', '').astype(float)
data2['Total'] = data2['Total'].str.replace(',', '').astype(float)
data2['Journal Reference'] = data2['Journal Reference'].astype(int)
data3['Journal Reference'] = data3['Journal Reference'].astype(int)

### Merge datasets

In [17]:
# merge data
df = pd.concat([data1, data2, data3])
df.reset_index(inplace=True, drop=True)

In [18]:
# see how the data looks like after the merger
df.head()

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
0,Childrens Services,IT Services,123-REG.CO.UK,23/04/2014,93,143.81
1,Childrens Services,Other Services,ACCESS EXPEDITIONS,03/04/2014,111,6000.00
2,Childrens Services,Equipment and Materials Repair,AFE SERVICELINE,02/04/2014,6,309.38
3,Childrens Services,Equipment and Materials Repair,AFE SERVICELINE,02/04/2014,7,218.76
4,Childrens Services,Building Repairs & Maintenance,ALLSOP & FRANCIS,15/04/2014,381,306.00

In [19]:
df.tail()

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
10025,Public Health,Equipment and Materials Purcha,VALUE PRODUCTS LTD,22/06/2016,8486,4.55
10026,Commissioning,Training,THE COACHING ACADEMY,21/04/2016,7844,600.00
10027,Commissioning,Training,THE COACHING ACADEMY,29/06/2016,8565,450.00
10028,Commissioning,Training,THE COACHING ACADEMY,18/08/2016,9144,1500.00
10029,Regional Enterprise,Training,PUBLIC SECTOR CONNECT,19/07/2016,8692,100.00

In [20]:
df.shape

(10030, 6)

In [21]:
# convert journal date to datetime
df['Journal Date'] = pd.to_datetime(df['Journal Date'], dayfirst=True)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10030 entries, 0 to 10029
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Service Area         10030 non-null  object
 1   Account Description  10030 non-null  object
 2   Creditor             10030 non-null  object
 3   Journal Date         10030 non-null  datetime64[ns]
 4   Journal Reference    10030 non-null  int64
 5   Total                10030 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 470.3+ KB

### Check for data duplication

In [23]:
df.duplicated(keep=False).sum()

840

In [24]:
df[df.duplicated(keep=False)].sort_values(by=['Service Area','Account Description','Creditor','Journal Date','Journal Reference','Total'])

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
2121,Adults and Communities,Equipment and Materials Purcha,Amazon EU,2014-10-06,3369,60.00
2541,Adults and Communities,Equipment and Materials Purcha,Amazon EU,2014-10-06,3369,60.00
2125,Adults and Communities,Equipment and Materials Purcha,Amazon EU,2014-10-08,3370,110.00
2545,Adults and Communities,Equipment and Materials Purcha,Amazon EU,2014-10-08,3370,110.00
2124,Adults and Communities,Equipment and Materials Purcha,Amazon EU,2014-10-10,3371,53.56
...,...,...,...,...,...,...
2849,Street Scene,Travelling Expenses,UK PARKING CONTROL,2014-10-06,3108,61.50
2329,Street Scene,Vehicle Running Costs,POST OFFICE COUNTER,2014-10-29,3506,287.50
2749,Street Scene,Vehicle Running Costs,POST OFFICE COUNTER,2014-10-29,3506,287.50
2328,Street Scene,Vehicle Running Costs,POST OFFICE COUNTER,2014-10-29,3507,400.00
2748,Street Scene,Vehicle Running Costs,POST OFFICE COUNTER,2014-10-29,3507,400.00

### There are duplicated rows in the data. Need to inquire the audit client why the data provided has these duplicated rows. Assuming that clean and legit data should have no duplicated rows, let's remove duplicated rows.

In [26]:
df.drop_duplicates(keep='first', inplace=True)

In [27]:
df.duplicated(keep=False).sum()

0

### Check for duplicated journal references

In [28]:
# Check for duplicated journal references after all-column duplication rows are removed.
df['Journal Reference'].value_counts()

Journal Reference
5213    5
5829    5
5721    4
7015    4
4829    4
       ..
3326    1
3325    1
3327    1
3332    1
8692    1
Name: count, Length: 7867, dtype: int64

In [29]:
df[df['Journal Reference']==5213]

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
4332,Children's Family Services,Travelling Expenses,OYSTER AUTOTOPUP,2015-02-16,5213,20.00
5491,Children's Family Services,Cleaning and domestic material,ASDA SUPERSTORE,2015-09-03,5213,5.00
5525,Children's Family Services,Equipment and Materials Purcha,ASDA SUPERSTORE,2015-09-03,5213,35.50
5554,Children's Family Services,Food Costs,ASDA SUPERSTORE,2015-09-03,5213,84.95
5617,Children's Family Services,Other Transfer Payments to Soc,ASDA SUPERSTORE,2015-09-03,5213,8.00

In [30]:
df[df['Journal Reference']==5829]

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
5490,Children's Family Services,Cleaning and domestic material,ASDA SUPERSTORE,2015-11-02,5829,3.60
5522,Children's Family Services,Equipment and Materials Purcha,ASDA SUPERSTORE,2015-11-02,5829,3.50
5552,Children's Family Services,Food Costs,ASDA SUPERSTORE,2015-11-02,5829,3.94
5625,Children's Family Services,Publications,ASDA SUPERSTORE,2015-11-02,5829,0.60
6276,Children's Family Services,Travelling Expenses,OYSTER AUTOTOPUP000,2015-05-21,5829,20.00

In [31]:
df[df.duplicated(subset=['Journal Reference'], keep=False)].sort_values(by=['Journal Reference','Journal Date','Service Area','Account Description','Creditor','Total'])

,Service Area,Account Description,Creditor,Journal Date,Journal Reference,Total
7261,Children's Family Services,Cleaning and domestic material,SAINSBURYS TO YOU 0567,2015-05-11,3084,28.30
7285,Children's Family Services,Food Costs,SAINSBURYS TO YOU 0567,2015-05-11,3084,59.41
2120,Street Scene,Equipment and Materials Purcha,Amazon EU,2014-10-03,3107,123.29
6319,Children's Education & Skills,Food Costs,KAYS DELICATESSEN,2015-05-13,3107,405.48
2429,Street Scene,Travelling Expenses,UK PARKING CONTROL,2014-10-06,3108,61.50
...,...,...,...,...,...,...
9039,Children's Family Services,Food Costs,SAINSBURYS TO YOU 0567,2016-08-23,9196,93.85
9048,Children's Family Services,Cleaning and domestic material,SAINSBURYS TO YOU 0567,2016-08-30,9299,16.70
9049,Children's Family Services,Food Costs,SAINSBURYS TO YOU 0567,2016-08-30,9299,186.14
9325,Children's Family Services,Cleaning and domestic material,ASDA HOME SHOPPING,2016-08-31,9304,11.00
9326,Children's Family Services,Food Costs,ASDA HOME SHOPPING,2016-08-31,9304,97.00

### There can be multiple credit card transactions per journal reference. However, why do some journal references have different journal dates? Need to inquire the audit client for more understanding.

In [32]:
df.rename(columns = {'Account Description':'Acc Name','Total':'Amount'}, inplace=True)
df.reset_index(inplace=True, drop=True)

The data has been preprocessed and now ready for EDA. Stayed tuned for the next parts.